{"posts":[{"title":"blog1","text":"","link":"/categories/blog/blog1/"},{"title":"item1","text":"","link":"/categories/item/item1/"},{"title":"project1","text":"","link":"/categories/project/project1/"},{"title":"reading1","text":"","link":"/categories/reading/reading1/"},{"title":"reading2","text":"","link":"/categories/reading/reading2/"}],"tags":[{"name":"life","slug":"life","link":"/tags/life/"},{"name":"CV","slug":"CV","link":"/tags/CV/"},{"name":"testcv","slug":"testcv","link":"/tags/testcv/"}],"categories":[{"name":"blog","slug":"blog","link":"/categories/blog/"},{"name":"item","slug":"item","link":"/categories/item/"},{"name":"project","slug":"project","link":"/categories/project/"},{"name":"reading","slug":"reading","link":"/categories/reading/"}],"pages":[{"title":"Curriculum Vitae","text":"ExperienceDeloitte (February 2022 - Present)I currently work as Machine Learning Engineer Consultant in the Artificial Intelligence and Data team at Deloitte Luxembourg. I mainly worked on two projects: Developped a Computer-Vision (classification, change detection, object detection) based product for analyzing large construction sites using satellite images: creation of automatic AI pipelines (using QGIS, GDAL, SciKit-Learn and PyTorch) handling large images and showcasing aggregated model outputs using Dash Plotly - all in Python. Created cutting-edge solution for an Australian client in Python using PyTorch (Faster-RCNN) to automatically detect hail damages and estimate repair prices on footage coming from 16 different cameras minimizing the time spent of analyzing vehicle damages from 30 minutes to five minutes. Aside these projects, I am involved in creating and organizing careers paths for all members of the team. It implies being aware of the technologies used in the industry as well as knowing the existing skills of the team. Codoc (July 2020 - February 2021)I made a six months internship at Codoc, a medtech startup developing a search engine for medical reports, as Data Engineer. My main tasks were: Conception and development of new ETL platform for healthcare data using Apache Airflow, Oracle DB and Python, deployed in many hospitals using Docker with CI/CD and monitored with Grafana. Used GCP as testing environment. Migrate existing Python and PHP NLP algorithms to the new platform using Pandas Dataframe and vectorization increasing processing speed by 10 times. Université du Québec à Montréal (April 2019 - August 2019)I visited the LATECE laboratory of Université du Québec à Montréal as Machine Learning Research Engineer. During this intership, I elaborated inference attacks with machine learning algorithms (decision trees and random forests), trained on public users’s GoogleMap GIS data in order to identify transport mode using SciKit-Learn framework in Python with Jupyter Notebook for sensibilization to geo-privacy platform maintained by INRIA. EducationUniversité de Technologie de Compiègne - Sorbonne Université (September 2019 - September 2022)I received a M.Sc. degree in Computer Science with specilization in Artificial Intelligence and Data Science from the Université de Technologie de Compiègne, France. Université du Québec à Montréal (January 2019 - April 2019)I did an exchange semester at Université du Québec à Montréal where I had the opportunity to follow my first Artificial Intelligence course. Université Paris-Saclay (September 2017 - December 2018)I received a two-year university degree in technology (french Diplôme Universitaire de Technologie) in Computer Science.","link":"/curriculum.html"},{"title":"index","text":"","link":"/index.html"}]}